from models import Library, Book, BookLib

# Библиотеки
libs = [
    Library(1, 'Главная библиотека'),
    Library(2, 'Университетская библиотека'),
    Library(3, 'Городская библиотека'),
    Library(4, 'Детская библиотека'),
    Library(5, 'Научная библиотека'),
    Library(6, 'Историческая библиотека'),
]

# Книги
books = [
    Book(1, 'Война и мир', 'Лев Толстой', 1865, 1),
    Book(2, 'Анна Каренина', 'Лев Толстой', 1877, 1),
    Book(3, 'Преступление и наказание', 'Федор Достоевский', 1866, 2),
    Book(4, 'Братья Карамазовы', 'Федор Достоевский', 1880, 2),
    Book(5, '1984', 'Джордж Оруэлл', 1949, 3),
    Book(6, 'Скотный двор', 'Джордж Оруэлл', 1945, 3),
    Book(7, 'Мастер и Маргарита', 'Михаил Булгаков', 1939, 4),
    Book(8, 'Собачье сердце', 'Михаил Булгаков', 1925, 5),
    Book(9, 'Доктор Живаго', 'Борис Пастернак', 1957, 6),
    Book(10, 'Лолита', 'Владимир Набоков', 1955, 6),
]

# Связь книг и библиотек
books_libs = [
    BookLib(1, 1, 5),
    BookLib(1, 2, 3),
    BookLib(2, 3, 2),
    BookLib(2, 4, 1),
    BookLib(3, 5, 1),
    BookLib(3, 6, 2),
    BookLib(4, 7, 1),
    BookLib(5, 8, 3),
    BookLib(6, 9, 2),
    BookLib(6, 10, 1),
    BookLib(2, 1, 9),
    BookLib(3, 2, 8),
    BookLib(4, 3, 7),
    BookLib(5, 4, 6),
    BookLib(6, 5, 5),
    BookLib(6, 6, 4),
    BookLib(1, 7, 9),
    BookLib(3, 8, 3),
    BookLib(2, 9, 3),
    BookLib(1, 10, 10),
]